[
{"asin": "ipad", "text": "The Apple iPad (9th Generation) is a powerhouse device that sets a new standard for versatility, performance, and portability. Whether you're a student, a creative professional, or someone seeking a reliable and powerful tablet, this iPad is a game-changer that will revolutionize the way you work, learn, and play.The standout feature of the Apple iPad (9th Generation) is its stunning 10.2-inch Retina display. The crisp resolution and True Tone technology deliver vibrant colors and sharp details, making it a delight to watch videos, edit photos, and read e-books. The larger display provides ample space for multitasking, making it ideal for productivity tasks and creative endeavors.The iPad is powered by the A13 Bionic chip, ensuring swift and smooth performance for demanding apps and games. The processor's efficiency maximizes battery life while providing impressive processing power, allowing you to tackle any task with ease. Whether you're editing videos, running graphics-intensive apps, or engaging in augmented reality experiences, the iPad's performance remains impeccable.The iPad (9th Generation) runs on iPadOS, which provides a seamless and intuitive user experience. With features like Slide Over, Split View, and the redesigned home screen, multitasking becomes effortless, enhancing productivity and efficiency. The integration of the Apple Pencil allows for precision note-taking, sketching, and creative projects, making it a valuable tool for students and professionals alike.The iPad's versatility extends to entertainment, with access to the vast App Store and Apple Arcade. From streaming your favorite movies and TV shows to playing immersive games, the iPad delivers a rich and immersive entertainment experience. With its powerful stereo speakers, you can enjoy immersive audio without needing external accessories.The tablet's front and rear cameras capture stunning photos and videos, making it a valuable tool for content creation. Whether you're capturing memorable moments, attending virtual meetings, or recording high-quality videos, the iPad's cameras deliver impressive results.The iPad (9th Generation) supports the Smart Keyboard and Apple Pencil, transforming it into a productive workstation or a creative canvas. The Smart Connector on the iPad allows for easy attachment of the Smart Keyboard, providing a comfortable typing experience for extended writing sessions.Additionally, with the iPad's all-day battery life, you can stay productive and entertained for hours without needing to worry about recharging. The iPad's lightweight design and slim profile make it easy to carry around, making it the perfect companion for productivity on the go.In conclusion, the Apple iPad (9th Generation) is a true powerhouse that redefines versatility and performance in a tablet. With its stunning display, powerful A13 Bionic chip, iPadOS capabilities, and compatibility with the Smart Keyboard and Apple Pencil, this iPad is the ultimate tool for unleashing your creativity and productivity. Whether you're a student, a creative professional, or simply seeking an all-around capable tablet, the Apple iPad (9th Generation) is a worthwhile investment that will enhance every aspect of your digital life.", "title": "Unleash Your Creativity and Productivity - Apple iPad (9th Generation) Redefines Versatility", "location_and_date": "Reviewed in the United States on July 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "ipad", "text": "My old Ipad Pro hasn’t worked for over a year and I also needed a new computer -  but didn’t need anything as sophisticated as a Mac so thought I would try out this 9th Gen Ipad.  So far it does most of what I would do with a larger laptop and has a touchscreen.  I was reluctant to buy Apple tech for quite a few years until I bought a small Iphone SE about 4 years ago - switched from a Samsung Galaxy..  The SE was a great size to carry around the city and it fit in most pockets and had great reception.  It was and still is a great piece of technology.  I upgraded to a 12 after 2 years and still use the SE around the house because it connects to wifi.  The 12 had a better camera and I had toddler granddaughters and after another 2 years I upgraded to the 14 PROMax which has a great camera, larger screen and is not unlike the SE except the bigger size to view photos.  I really love the touchscreen feature for NYTimes games and other interactive apps.  I worry about having most of my pictures on this technology because they could move to a more sophisticated system and make these obsolete - which is a concern. My daughter’s Iphone 13 fell in the snow a few years ago and she somehow lost all her pictures that she thought were in the cloud.  I held on to my 12 because it holds quite a bit of what she lost since we shared their photos.  Neither of us is sure why this happened and if it could happen again.  If I have a stand alone camera it isn’t convenient but I have the photos detached from the technology and the whims of a large multinational behemoth.  So far I am happy with the Ipad and am still learning how to use it.  I found a case that closes securely and  can stand in portrait or landscape mode which is really nice when viewing Netflix or AppleTV.  If you need a new computer to carry conveniently this Ipad is the way to go unless you really need the power and graphic abilities of the MAC.  My Iphone 14maxpro has 256g of memory and I barely use 100 so I thought I would only need 64g on the Ipad since my phone has the extra capacity.  Not convinced this was a great decision but some of my Iphone content can stay there exclusively  so it might just work out.  Or not…..", "title": "Nice IPad.  Larger than I thought it would be but easy to carry in a bag", "location_and_date": "Reviewed in the United States on July 22, 2023", "verified": true, "rating": "5.0"},
{"asin": "ipad", "text": "This iPad 9th Generation replaced my 6 year old iPad 5th Generation.  I backed-up my old iPad so transitioning to the new one was a relatively easy process and I was good to go almost immediately. My 5th Generation began to crash and would begin to re-boot itself a few times. This has not happened with the 9th Generation and I'm looking forward to using it for a long time. The 9th Generation features a larger screen and faster processor and the battery lasts all day. I use my iPad almost every day and it's my go-to device for social media, email, and surfing the web. NOTE: I recommend that you buy the iPad with 256  GB instead of the 64 GB model. You'll be glad to have the extra memory.", "title": "Great Product", "location_and_date": "Reviewed in the United States on July 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "ipad", "text": "I ordered the 64gb on Amazon brand new  for $265 out the door and they ended up sending me a 256gb one. Even if I got the 64gb you can’t beat that price for what you’re getting. If you’re looking for a tablet to stream shows, read books, browse the internet, FaceTime or zoom friends and family I wouldn’t spend the extra money on the newer iPad 10 which is $400 right now. You will not notice any differences in speed and quality of the picture. They are very close in stats. $265 is a steal for this if you want an iPad that is very capable and still up to date with the times.", "title": "Can’t beat the Value right now", "location_and_date": "Reviewed in the United States on July 29, 2023", "verified": true, "rating": "5.0"},
{"asin": "ipad", "text": "I’m glad to find a great price, I paid same $ for my 6 gen in 2018! I’m getting used to new features, however, I don’t like having to have a password as it’s only for my personal use. I do my “business “ , pay bills, email, text, etc. it’s gray but I have it in a cover so that’s not a concern for me.  I’ve been an iPad user for 13 years.  I love my phone, but when possible I like my iPad to look at pics and enlarge type for kindle and other reading, and I don’t have to wear my glasses 🤓! This is my second iPad thru amazon.", "title": "Upgrade from 6th generation", "location_and_date": "Reviewed in the United States on July 27, 2023", "verified": true, "rating": "5.0"},
{"asin": "ipad", "text": "This replaced ipad 5th generation, so the screen is larger & appears to be easier to view. Other than that they are pretty much identical in physical appearance, of course 9th gen has a faster chip along with a few more advanced features, camera/apps, etc. I mostly use it for surfing internet & games & would definitely buy it again. I didn’t like the fact that the stowage went from 64GB to 256GB skipping the normal 128 GB & going to 256 GB was too pricey for my intended use.", "title": "Excellent iPad", "location_and_date": "Reviewed in the United States on July 28, 2023", "verified": true, "rating": "5.0"},
{"asin": "ipad", "text": "I was able to score the is 9th gen iPad on a prime day deal for 250, for under 300 this thing is an absolute beast of a tablet. Sure the design is dated but the accessories to fit this classic design are abundant. Battery life is all day even for someone more gaming centric like myself. Speaking of this thing absolutely games just fine hitting 60 fps on everything I throw at it, along with its 264 ppi display media consumption and social media doom scrolling look fantastic. If you’re interested in dabbling in the Apple ecosystem without breaking the bank this is the iPad to try. This budget king is gonna get updates for years to come.", "title": "Premium Quality At A Fantastic Price", "location_and_date": "Reviewed in the United States on July 22, 2023", "verified": true, "rating": "5.0"},
{"asin": "ipad", "text": "I really needed a new iPad and saw this one.  The price was good.  I can’t say anything bad except the battery life is far from all day.  I’ve been trying to run the battery down completely before charging it.  But I’ve been playing games one line for just over 2 hours this morning and only have 36% left.  This ad is very misleading in that respect.  Overall I’m pleased.  I just wish Apple wouldn’t say things they know are not true, unless there is a way to keep battery life longer that I’m unaware of.  This is my 3 rd IPad.  So I am a devoted customer.", "title": "Pretty Happy.", "location_and_date": "Reviewed in the United States on July 26, 2023", "verified": true, "rating": "4.0"},
{"asin": "ipad", "text": "I have had my iPad 9th Generation 64GB Wi-Fi since the end of November, 2022. It has been about 5 months. I upgraded from an iPad Air 2 32GB Wi-Fi (2014 model) that I had for almost 6 years! I have to say that there is a reason why Apple iPads are sold at such a premium price. That's because they provide valuable practical use for far longer than the vast majority of what is available in the tablet market.With that said the 2021 iPad 9th Generation is a base iPad with a limited amount of fancy features and a dated iPad design. Quite frankly, I actually use my iPad on the go and all of the iPads I have had go directly into an Otterbox Defender case. So I hardly notice the little aesthetics in design when my iPads area always in an Otterbox Defender case.I won't make this review long and will highlight the particular reason why I feel the need to write this review at all. I would say there's three top reasons why I believe the iPad 9th generation is excellent: 1. Good CPU performance/64GB base memory capacity, 2. Value pricing, and 3. Apple Pencil/Freeform.1. CPU performance is good with the A13 CPU from the iPhone 11. I am confident that I will be able to use this iPad for at least 4 more years, if not 5. I bought my iPad Air 2 (2014 model) in 2016 and it was supported with OS updates up until iPadOS 15, which is a total of 8 years. But the iPad Air 2 was among the longest supported iPads in Apple's tablet history. So it is not likely to be repeated. But I think that the iPad 9th generation should be supported for at least 6 years, 2021 to 2027. Plus, the 64GB base capacity is excellent for my basic use of the iPad.2. The pricing for the iPad 9th Generation 64GB retails at $329.99, but it is often for sale at $269.99. That's how much I purchased it for during Cyber Monday 2022. It has been on sale for as low as $249.99 at some other retailers as well. So overall, the pricing is very affordable for a device this capable with support for many years to come.3. I know that the Apple Pencil has been out for years, but I have only now tried it. It was not supported with my iPad Air 2 (2014 model) and I never gave it much thought as being useful to me. I always thought that the Apple Pencil was geared towards artists, which to some extent it is. I tried the Apple Pencil on my iPad 9th Generation about a month after getting mine. It was a revolutionary experience for me. I have been looking for a viable substitute for a whiteboard for the longest time. But there is not any real replacement for what you can do on a whiteboard. The Apple Pencil with FreeForm is the closest that I've come to the experience I get on a whiteboard. Although, I do still use a 4'x8' whiteboard for some brainstorming sessions, the Apple Pencil has afforded me to do some basic brainstorming in FreeForm. This is a massive benefit and I can only see Apple getting better with its FreeForm app. Not to mention app developers releasing new apps to take advantage of the Apple Pencil for brainstorming on a virtual whiteboard.Overall, I highly recommend the iPad 9th Generation.", "title": "Apple does it again, the best of Apple in a great price!", "location_and_date": "Reviewed in the United States on March 26, 2023", "verified": true, "rating": "5.0"},
{"asin": "ipad", "text": "Every night I go to sleep watching my IPad.  During a recent trip to Mexico my iPad was stolen and I had to buy another one.  Apple products are my go to so I was looking for price and convenience.  I bought a new IPad from Mexico on Amazon and it was already on my front porch when I returned.  Great product at a great price with a warranty and I didn’t even have to change my plans to have on time quick delivery right to my front porch and ready for me when I got home.", "title": "Easy access to my necessary Apple products", "location_and_date": "Reviewed in the United States on July 16, 2023", "verified": true, "rating": "5.0"},
{"asin": "samsung", "text": "In retrospect i should have bought the ultra. Its not small enough that i can use one hand. Ive had this phone for over a year now and it is very fast. However, i remember when i first got it, the internet kept dropping, i think after a few updates (couple of months) that problem resolved itself. The camera is great. Speakers are good. Bluetooth fine. Touchscreen is awesome. This is like my 4th smartphone. I remember my first one and it is my favorite, the s2. The fingerprint reader is really cool. I make videos and content like every month. Im always finding new things. Photo editing is fun. Contact less payments are interesting. I recommend this phone over other brands. Buy a battery bank.", "title": "Good expensive phone", "location_and_date": "Reviewed in the United States 🇺🇸 on July 14, 2023", "verified": true, "rating": "5.0"},
{"asin": "samsung", "text": "Had this phone for the past 4 months. Great purchase, always a happy samsung customer! The battery life is something almost everyone complained about, which is why I was hesitant at first to buy the S22 regular.However, it is not as bad as people make it out to be. I have always been a samsung user and had a samsung galaxy pro before I switched to this one. The battery life is less compared to that, of course. But then again, features have also been added and the battery lasts me almost a full day even though I use it almost full time. Hope this review helps. I am glad with my purchase.", "title": "Works great!", "location_and_date": "Reviewed in the United States 🇺🇸 on April 26, 2023", "verified": true, "rating": "5.0"},
{"asin": "samsung", "text": "I'm upgrading from a Samsung S9, perhaps the best small phone of its era. I loved it. I was skeptical of the S22 because of the negative reviews so I actually bought an iphone 13 pro. That just wasn't any better. The screen wasn't great. It was heavy. Somehow it felt even bulkier than the S22, even though of course Apple \"claims\" essentially the same size specs. Off topic. Back to the issue:I returned the 13 and bought the S22 because I knew I would be frustrated with whatever I bought. I will not buy these jumbo phablet monstrosities. I am a man and it needs to fit in my pocket (under 180 grams, less than 6.25 x 3 x .33). I do not have a purse.And I wanted a flagship camera. So this is it people. If I've missed a phone, please leave me a response!That all said, the S22 apart from the battery, is *amazing.* The pictures are a staggering step up from the S9. The screen is bonkers. Seriously. I know it is lower resolution than the S9, but that is not what is important. This is the best screen I've ever seen. Brightness, accuracy, clarity, depths of blacks, color reproduction. It's amazing. The iPhone 13 pro was noticeable inferior.The S22 is also blazing fast. I don't do any power user stuff like games, but for normal use, every thing is instantaneous - noticeable faster than the S9.  Even Android 12 isn't total #$%@. It works really well so far and has solved many problems I've noticed in the past.Battery: Like I said. I don't have a choice. This phone has the best overall package for me. The iPhone was weak enough that I don't feel like I'm missing out. I've set screen refresh to 60 Hz to save battery life. I expect to get a standard full day out of it. If I'm out in an area with no access to recharge and a high need to make calls (theme park with the family), I will use it sparingly. Frustrating, yes, but not a deal breaker.This phone has made me surprisingly happy. With a true crystal case in the forest green color, it is beautiful. It feels good to hold. I'm loving it so far.Hope this review helps.", "title": "Provisional 5 Stars - Minor Battery issues offset with *brilliant performance* elsewhere", "location_and_date": "Reviewed in the United States 🇺🇸 on May 24, 2022", "verified": true, "rating": "5.0"},
{"asin": "samsung", "text": "Purchased this phone as an international unlocked unit for just over $800 shipped. Shipping was great speed wise but packaging was horrendous. They had the phone in its typical box packaged in another box about 2x the size of the phone box with no supportive packaging (besides 2 deflated air packs, how useless). It was just sliding around willy nilly. The phone seemed to be ok though and I proceeded with using it. My current situation with the phone is that it is set up for the most basic usage. I use it to call, text and use the internet and Facebook messenger. That's about it besides a game I use to play Euchre on, which is rare and I have yet to use it in the week or so I have owned this device. The phones battery is pathetic as compared to the Motorola Moto G 2021 it replaced. This phone with moderate usage will last the work day and a little extra (8 ish am till 10:00 pm), If I am lucky. With light usage it will last that plus till around noon the next day. Additionally, the battery life after it gets under 15% is abysmal. It will go down to 5% within a half hour and then after it hits 5% it just shuts off. The Alarm is annoying as all get out. For whatever reason. I have a SINGLE alarm set. If I want to snooze it and I use the notification pop up to do it instead of the clock app itself it will start ringing again TWICE at the snooze interval, like the alarms are simultaneous and ring just out of sync with each other if snoozed this way. Otherwise the phone does what any other free phone you can get at your local retailer for free with a startup plan. I thought that paying up an additional $450 ish bucks would net me a better device but, I guess I just fell for the flagship phone and I feel like it really was not worth it at this point. I hope to have the device last me a few years and hopefully the quality of it will sustain the test of time and I will not continue to experience other issues with it.", "title": "This is what $800+ gets you? Really?", "location_and_date": "Reviewed in the United States 🇺🇸 on May 3, 2022", "verified": true, "rating": "3.0"},
{"asin": "samsung", "text": "After I go to the mountains or sometimes climb a sand dune, the sound from one of the speakers stops working right, everything sounds robotic and almost grainy, and to fix it I have to reboot the system and open and close the sim card tray. It didn't start until after my return time ended and now I carry a paperclip in my case at all times so I can open the sim card tray as necessary because it's impossible to understand people on the phone when it does that.Battery life is much improved from my last one but still not impressive.Water resistance is great. It survived a 15 minute swim fully submerged in the ocean and didn't have a single problem after.Pictures are fantastic. I love the camera!I've only had it about 4 months. The main issue is the speakers being weird.", "title": "Sounds goes weird after going into higher elevations.", "location_and_date": "Reviewed in the United States 🇺🇸 on October 15, 2022", "verified": true, "rating": "3.0"},
{"asin": "samsung", "text": "Plenty of other people seem to feel the same, that this s22 series feels like a downgrade. Less intuitive, more \"bloatware\" from samsung, as they feel the need to compete with google on every level. Constantly apps are trying to ask if I would rather use the Samsung version of the app I am already using in endless permission loops with their apps, that don't have a good definition of what the word 'NEVER' means. I am absolutely certain this phone is doing a bunch of processes twice, like saving my contacts and such to google and Samdung. Uploading photos to both clouds, trying to save my credit card info EVERY TIME, etc. Tried to make a quick call while needing to keep my attention elsewhere and the damn thing gave me a dead-end option list of two different phones to use, took me 4 minutes just to start the call after I had completely stopped what I was doing. Sounds confusing? Yeah no kidding. This thing is engineered to be frustrating in the hopes you'll upgrade to a more expensive model in my opinion. The reception is never great, and I have tried 3 different service providers. I constantly pick the phone up to try making a call or to text to discover there is an issue and it's not sending or receiving anything at all until I reboot or reset the network. The feel of it in hand isn't great either for me. I don't come from Iphone, and don't particularly like apple products. Why emulate their design? Gone are the smooth, rounded edges of the s21. This thing is damn close to being a rectangle. It's smaller than the s21 yet somehow feels larger, definitely clunky in comparison. all in all, I have no idea what Samsung was thinking with this phone, this ship has sunk.Edit: Returning this phone due to the worst of these issues: almost every day I notice the phone is unable to send or receive calls or texts until I reboot the phone or network settings. This is a massive inconvenience and a definite deal breaker.(As a side note: I bought a 'burner' from Walmart for temporary use while going through this process to find a good phone, and while it is not nearly as pretty as a flagship phone, I can say however, it does in fact send and receive calls and texts without the need of a daily reboot/reset. Samsung out-performed by a $100 phone from WALmart. Embarrassing.P.S. AMAZON: Thanks for being awesome enough to accept phones back to begin with. That in of itself is the deal maker. You're the MVP this week for sure. Prime membership renewed for another month. Take my money and for the love of God, Peddleme608.", "title": "Seems like a downgrade.", "location_and_date": "Reviewed in the United States 🇺🇸 on May 10, 2022", "verified": true, "rating": "1.0"},
{"asin": "samsung", "text": "Let's be real here guys we bought the bottom tier flagship from Samsung.The phone works amazing great pictures decent everything and for the price it's better than most 1000$ flagship.My only gripe is that the battery is average (not flagship) but that's my only issue and a charge will still get me through most of the day. If your on your phone 24hrs a day I recommend the s22+ for the larger battery.", "title": "It's a good phone I recommend it", "location_and_date": "Reviewed in the United States 🇺🇸 on July 26, 2022", "verified": true, "rating": "4.0"},
{"asin": "samsung", "text": "this bad boy is definitely worth the money, it is my best pal. i got pushed into a pool with it in my pocket and was in the water for a few minutes before i realized my phone was on me, but no worries, it powered through as if it were water proof. the face recognition is a little odd (but that could have something to do with my hair all in my face) but the fingerprint sensor makes up for it. also the camera on this thing is rad.", "title": "HEAVENLY", "location_and_date": "Reviewed in the United States 🇺🇸 on July 14, 2022", "verified": true, "rating": "5.0"},
{"asin": "samsung", "text": "I compared the screen sizes before upgrading and this phone is noticably smaller. I should have returned it right away. Would not buy again feels like a toy.", "title": "Smaller than S9", "location_and_date": "Reviewed in the United States 🇺🇸 on June 13, 2023", "verified": true, "rating": "2.0"},
{"asin": "samsung", "text": "It should have better battery life.", "title": "Poor battery life", "location_and_date": "Reviewed in the United States 🇺🇸 on September 29, 2022", "verified": true, "rating": "4.0"},
{"asin": "sony", "text": "We have had this camera since 1 June 2021and we purchased it to see if a compact full frame camera would work for us. We were looking for a smaller camera that was not an APS C sensor based camera.First a little background. My wife and I are keen semi professional photographers and own a Canon R5, Canon R6, Nikon Z6 II and Fuji X T4, along with a good selection of Canon RF, Nikon S Z and Fuji XF lenses. I have owned the Sony A7RIII and A7RIV and traded them for the Canon R5 and R6 cameras. We have been taking pictures for over 60 years in my case.I traded the Sony A7RIII and Sony A7RIV simply because I did not like taking pictures with them. Technically they were superb but they were difficult to handle and the new Canons (R5 and R6) were a revelation in handling and I 'wanted' to take pictures with them. I say this because I expected to dislike this A7C. It has the same menu system as the A7RIII and A7RIV (which I did not like) and the comments on the EVF and lack of controls in the reviews made me wonder why I wanted to try this.However it is the size that wins you over immediately. Picture quality is superb and autofocus is excellent. This is a full frame camera in the body of an APS C body and it handles exceptionally well. Somehow those awkward angles etc. of the bigger bodies goes away and it feels so good in both my wife and I's hands. I cannot confirm whether the autofocus is better than the A 7III but it seems the equal of the A 7RIII and A 7RIV, if not a little better (I do not have them to test them side by side but it certainly feels that way). In short we love this camera and, and this is the 'real' test, we tend to take it with us when we are looking to have a camera with us just in case.Pros:1. Small body that feels solid and beautifully made. Access doors are nice quality (not floppy rubber plug in pieces) and fully weather sealed.2. Excellent out of body JPGs, RAWS excellent and easy to recover detail in the shadows and highlights.3. Superb Autofocus that glues to your subject.4. Fast operation.5. Flexible 'flippy' screen.6. Access to a wide range of FE lens mount lenses.7. Kit lens is much better than you would expect and very small. Ideal for street photography and the one lens you might just happen to have with you.8. Excellent battery life.9. Excellent video output.10. In body image stabilization.Cons:1. The EVF is truly awful but just about allows you to aim the camera and take a picture when the rear screen is not viewable.2. Lack of a joy stick is an irritant to me,  but you get used to it.3. Kit lens 60 mm max focal length is too short and the wide angle is not wide enough (28 mm). An equivalent to that Canon RF 24 -105 f/4 - 7.1 would be wonderful.4. The Sony lenses are large for their capabilities (the F/4 24 -105 is enormous), Canon make smaller and better lenses for full frame. However Tamron are filling the gap. We have bought the F/2.8-5.6 28 to 200 mm Tamron for the A 7C and it is a good match, still not small but light and still easy to use and handle.5. IBIS not good enough for video, and needs a gimbal.We love this camera and we use it a lot (we have aleady taken around 4000 shots!!) and used it in a wide variety of conditions where it has excelled. Thoroughly recommended.", "title": "This is an amazingly competent camera", "location_and_date": "Reviewed in the United States on August 8, 2021", "verified": true, "rating": "5.0"},
{"asin": "sony", "text": "Its easy to carry while on outside only one thing that I don’t like is viewfinder is small and on side is little annoying.", "title": "Small and easy to carry", "location_and_date": "Reviewed in the United States on July 2, 2023", "verified": true, "rating": "5.0"},
{"asin": "sony", "text": "I really do love this camera. Paired with a G lens, it delivers unbelievably beautiful images effortlessly. The advantage of the a7c is that it’s optimized for size, but honestly I don’t think it’s small *enough* to make a noticeable difference compared to an a7iii or any other full-size a7. The higher resolution EVF and the better touch interface on the full-size bodies might be a better choice.", "title": "Terrific camera, but not sure if it’s better than a7", "location_and_date": "Reviewed in the United States on May 24, 2023", "verified": true, "rating": "4.0"},
{"asin": "sony", "text": "The A7c gives me access to next level low light video and photos. This is something that my m4/3 panasonic cameras (G9, G85) struggled to deliver, even just indoors on a sunny day with a nice f2.8 (or even 1.7) lens, the ISO could skyrocket. This was the main motivation for obtaining this camera, and it does not disappoint, with at least a 2-fold improvement in low light performance (max iso set to 3200 and usually sufficient for vids and photos). I am also very impressed by the featherweight budget samyang 18mm f2.8. After testing of many custom presets and getting to grips with some manual focus quirks,  I think I have an A7c  which can do just about everything I need  (stored in the 7 custom camera config preset slots). I can instantly make it into a deluxe GoPro (wide and everything always in focus), low light video Ap/Sp, astro timelapse, day timelapse, low light tracking auto focus stills......... Importantly, it is the same weight as a panasonic G85 which is critical for a travel/backpacking/bike camera (I need). I can put it on the crane M2 mini-gimbal for decent stabilization, and still be discrete/small enough to not feel like a sore thumb. This is the deal when you move from panny m4/3 - I swapped low light performance for effective stabilization. The catalyst giro stabe in post is a bit last resort, but a nice thought.  It is awesome to have access to the older manual FF lenses -  budget great glass - without all the crop factor PITA with m4/3 or APS-c. The big downside of this camera is lack of any intuitive user interface - it will do it all - but wow - it is quite a learning curve to test and set up this stuff. I guess you get out what you put in. As a panasonic G9  shooter (camera with very nice user interface),  the HUGE elephant in the room is usability and the lack of a touch screen. Compared to the G9 this camera has very poor organization and on-the-fly tweakability. The workaround here is extensive testing and the use of personal menus and custom presets, but even then the lack of a touch screen for at least review is just criminal. In summary, this camera really delivers full frame dazzle, is a good fit for light weight adventures (only with the additional M2 gimbal and lightweight lens), but IMO needs real commitment  from any non-sony shooter to get the preset settings dialed in and make it all work.9 month update --  removed a star to 4/5: in the end the lack of workable IBIS, touch screen and very fiddly menus caused me to give up with this camera.  For the way I shoot video (stopped down, lots of manual) the Sony AF was not as valuable as I expected. I found it was not so great at f>5, and with low contrast scenes (snow, landscapes).  I acquired a Panasonic S5, and so far its working perfectly for me.", "title": "Sony A7c: no limits full frame compact camera (if you know the options.........)", "location_and_date": "Reviewed in the United States on April 10, 2021", "verified": true, "rating": "4.0"},
{"asin": "sony", "text": "This camera is the first in its class that competes with its successors like the a7iii or a7iv. It's has the pros of both those cameras while also being very compact that its fits into your pocket. Best part of it all.is that it is full frame so any of those Sigma lenses fit perfectly onto this bad boy. It's really an investment to see how far this camera will take you. This is like when the first smartphone was released, all those things you need in a camera is in the palm of your hands.", "title": "Best compact full frame camera ever!", "location_and_date": "Reviewed in the United States on March 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "sony", "text": "There are many technical reviews on this camera that is better than anything I can say here.  I wanted a camera mainly for video and would like to share how I came to chose the 7c.  There are lots of other choices, but this checks all the important marks that I was looking for.  I started fresh without any prior lens and accessories.  I first evaluated which brand and system of camera I want.  The industry is moving towards larger full frame sensors.  There's Sony, Canon, and Fuji.  I feel that Sony is the leader in product development and innovation.  So I went with them.  I could have bought the 7siii, but the 7c is much much more compact and at this point fits my need.  I could have chosen the a6600, but I think the full frames have better picture, especially in low light.  And is a better upgrade path towards other Sony full frames in the future.  I could have gone with a GH5, but that's a much larger camera with sucky focus and low light performance.  And though I like Canon, they don't have a full frame in this size.  They have better lens selection for sure, but I feel they are not quite as innovative.So for my compact video travel rig, I have the 7c with one set of lens...the Tamron 17-14mm.  For audio I bought the Sony eco-81m shotgun mic.  This mic operates in digital mode, and powers off the 7c battery so no extra cord or battery to worry about.  So far it's been the perfect system for me.  I do have larger hands so the grip is just a bit small.  I ended getting the Smallrig cage. I was worried this might add bulk to my system, but it fits like a glove and adds no perceivable bulk.  It adds protection as well as gives me a much better grip surface.I love my set up.  It has everything I want in a travel video camera.", "title": "Great compact travel camera", "location_and_date": "Reviewed in the United States on January 28, 2021", "verified": true, "rating": "5.0"},
{"asin": "sony", "text": "Throughout the years I’ve owned the a7RII and the a6500 and this camera has combined to become the one camera body to rule them all for my uses. I always loved the size/weight of the a6500 but hated the crop sensor limits especially with available third party lenses. Well now I have a ultra compact FF camera body that is just as portable and discreet as the APS-C lineup of cameras which fits my needs perfectly.I am not a professional photographer or vlogger but just a casual photo hobbyist so this camera might not work for everyone and my views are coming from my level of experience. With that said there is one big thing that annoys me most about this camera vs the a7 lineup and that’s not having a front scroll wheel on the grip (that was stupid…why Sony…WHY?!) and far fewer customizable buttons vs the a6XXX lineup. Had Sony merged those two items into this camera body it would be a 5 star home run. I’m learning to live within the new limited perimeters of the camera itself and adapt to the different layout and lack of customization but it is a different experience than I was used to on both previous camera body setups.Anyway, if you can get passed those shortcomings and want a small body with a FF sensor then this is your only option. The small manual lenses that can be used with a cheap adapter available on eBay are plentiful and ultra cheap (Minolta 55mm f/1.7…..$40 on eBay) and having programmed a custom button for manual focus zoom and using focus peaking you can get excellent pictures that are incredibly sharp wide open with this camera. My general recommendation is for people to not be afraid to use manual focus lenses. Once you get used to them you can be just as fast as the autofocus on a Sony branded lens that is 5-20 times the price.Speaking of autofocus…the eye autofocus and autofocus abilities is the exact same tech as found in the a7SIII camera so it is incredible and according to reviews I’ve watched/read it is much improved over the competing a7III as well.", "title": "Exactly what I needed!", "location_and_date": "Reviewed in the United States on June 4, 2021", "verified": true, "rating": "4.0"},
{"asin": "sony", "text": "im just starting out with photography and after A LOT of research, I couldn't be happier with this camera!", "title": "great for a beginner", "location_and_date": "Reviewed in the United States on May 14, 2023", "verified": true, "rating": "5.0"},
{"asin": "sony", "text": "I use this for work videos and for family photos and it's fantastic.The only hoop is for video you have to get within 1/3 of a stop within exposure of what you want and white balance because post production is a lot easier with 10 bit, 4:2:2, etc.", "title": "Best Camera I've owned", "location_and_date": "Reviewed in the United States on April 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "sony", "text": "Best Camera for Your LifestyleThis is the best camera for recording your lifestyle and express yourself. Sony Alpha 7C is the most compact full-frame mirrorless available in the market. Its lightness and well-balanced body help you carry it wherever you go without any second thought. Its uncompromising capability and quality let you obtain the highest quality images and videos anywhere and at any moment. I would recommend this camera for people who want to upgrade from crop body, serious about recording your lifestyle, content creator, professionals who need a second body.Swivel screenThis is the second Sony full-frame camera with an articulating screen. Another one that has this screen costs much more. It changes the game in the sense that you have much more freedom in your shot angle and also monitor yourself for the self-shot without any other accessories.Sony Auto Focus TrackingAutofocus and Video focus tracking are out of this world. You will not sacrifice shots that are out of the focus. Especially, Auto tracking enabled in the video makes this camera best for the Vlog. The enhancement on the screen brightness is an upgrade from a7m3. Some suggest viewfinder is a downgrade, but I had no problem with it. I also like how detail you can adjust focus transition speed to make it more cinematic. I wanted it to have an updated Sony menu system, but it has the previous generation touch menu system with a menu button in a weird location.Video reliabilityThis is also a great camera for video recording with unlimited video recording minutes. You can make a professional-quality video for any type of conference or lecture. I see this can be even a great sub-camera for the professionals to have that reliable second and third view of the recording.New Compact bundle LensSony created a new FE 28-60mm F4-5.6 compact lens to go in hand with Sony A7C. I took several shots with this lens and it was a pleasant surprise. I usually do not have any high hopes for the bundled lens and especially the small lens. However, this produces great quality images. The compact lens size and lightness draw you to use it more often than you think.", "title": "Best Camera for Your Lifestyle", "location_and_date": "Reviewed in the United States on January 6, 2021", "verified": true, "rating": "5.0"},
{"asin": "versace", "text": "The aroma is very close to the authentic Versace. While traveling, I happened to use it in the restroom ~ as I do not like traditional restroom sprays; this stuff is awesome to use in restrooms .... lol; since it is such an affordable cost, I will continue to use it in the restroom to give it a really nice and long lasting fragrance; just so we are honest, I will actually wear the authentic Versace parfume .... but again, this is a good alternative that happens to serve as a superb restroom fragrance ...", "title": "While not authentic Versace, it is a good and cost effective  alternative ...", "location_and_date": "Reviewed in the United States on July 13, 2023", "verified": true, "rating": "5.0"},
{"asin": "versace", "text": "It smells really nice, truly. But since my son has found this lovely scent it has become ingrained into my walls. You go within a 10 foot radius of the boys room and you can smell the red bottle.  The best part is he’s only used a 3rd of the bottle! So it really goes a LONG way. All jokes aside the price was more than fair. The cologne goes a long way. You don’t need much and smell nice.", "title": "My 14 year old baths in this stuff", "location_and_date": "Reviewed in the United States on July 12, 2023", "verified": true, "rating": "4.0"},
{"asin": "versace", "text": "If I’m being honestly I didn’t look at how much it was so I didn’t know what size it was all I looked at was the price and the price I expected at least 10-15 ml but 5 ml for 15 dollars is crazy I went to my nearest store where they sell 5 mls and they said they sell them for 7 dollars smh 🤦‍♂️", "title": "Good but 5 ml for 15 dollars", "location_and_date": "Reviewed in the United States on June 24, 2023", "verified": true, "rating": "4.0"},
{"asin": "versace", "text": "This s an amazing cologne. I got it based off of a friend’s recommendation and I am so glad I did. I ordered it last minute for my husband for Father’s Day. It arrived a day early which was awesome but I cannot tell you how wonderful it smells. I think it’s my new favorite!! It’s truly yummy!❤️. I also love how long it lasts. It’s really sting and lasted all day! Very nice!! You will not be disappointed! Your man will love it and so will you!", "title": "AWESOME!!", "location_and_date": "Reviewed in the United States on June 19, 2023", "verified": true, "rating": "5.0"},
{"asin": "versace", "text": "I bought this cologne for my dad and he loves it .", "title": "5⭐️", "location_and_date": "Reviewed in the United States on July 28, 2023", "verified": true, "rating": "5.0"},
{"asin": "versace", "text": "Cada que me aplico este aroma siento que estoy en alguna de las playas del mediterráneo, sin duda gran compra", "title": "Aroma Mediterráneo", "location_and_date": "Reviewed in the United States on July 22, 2023", "verified": true, "rating": "5.0"},
{"asin": "versace", "text": "It’s most certainly a nice fragrance and it will last you probably at max 4 days then you’ll need to get another", "title": "Definitely nice", "location_and_date": "Reviewed in the United States on July 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "versace", "text": "I have Eros and this was Eros Flame w/Sandlewood so I was like alright I love sandlewood, but it's to much like Eros  w/sandlewood and nothing else. They didn't  add anything else to change its DNA and your left with just a boring Eros w/sandlewood added. If you have Eros Flame don't expect much from this but if it's your thing and you gotta have it I understand.o", "title": "It is what I thought it would be, which isn't bad but not good either", "location_and_date": "Reviewed in the United States on June 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "versace", "text": "Love it alot", "title": "Great stuff", "location_and_date": "Reviewed in the United States on July 28, 2023", "verified": true, "rating": "5.0"},
{"asin": "versace", "text": "Excelente productos", "title": "Calidad buena", "location_and_date": "Reviewed in the United States on July 29, 2023", "verified": true, "rating": "5.0"},
{"asin": "nike", "text": "My daughter loves these shoes. We decided to try Amazon because they were very difficult to find in the stores.", "title": "Popular Shoe", "location_and_date": "Reviewed in the United States on July 25, 2023", "verified": true, "rating": "5.0"},
{"asin": "nike", "text": "I’m not a authentic shoe expert, but they look fine to me (will update if they start to break apart). I’ve included pictures if that helps determine authenticity, but personally I don’t care. I did notice the Nike site is selling these again soon, so might be an option for those looking.", "title": "Look as expected", "location_and_date": "Reviewed in the United States on June 21, 2023", "verified": true, "rating": "4.0"},
{"asin": "nike", "text": "This is a really great shoe, great quality and fit excellent.  My advice to you is please know your size before you purchase, if you a size 9 I would suggest the size 8.5  I'm 10 and the 9 fits me perfectly.", "title": "Great Quality", "location_and_date": "Reviewed in the United States on July 4, 2023", "verified": true, "rating": "5.0"},
{"asin": "nike", "text": "This shoe came in a refurbished box and for some reason ran smaller than normal. All my other Dunks fit. Otherwise it's very pretty and colorful. Good quality! I would purchase again.", "title": "How the shoe fits", "location_and_date": "Reviewed in the United States on June 16, 2023", "verified": true, "rating": "4.0"},
{"asin": "nike", "text": "Le encantaron a mi esposo", "title": "Lindos", "location_and_date": "Reviewed in the United States on July 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "nike", "text": "This pair got to me early and are very nice not like the last pair that cost me 500 dollars and still don't have them.", "title": "Was delivered early and are awesome.", "location_and_date": "Reviewed in the United States on June 27, 2023", "verified": true, "rating": "5.0"},
{"asin": "nike", "text": "Didn't expect to get the shoes that fast, it took like 2 days, and it said it would arrive in 5 days", "title": "So clean", "location_and_date": "Reviewed in the United States on July 2, 2023", "verified": true, "rating": "5.0"},
{"asin": "nike", "text": "These were a gift for my boyfriend for Fathers Day. I was skeptical getting sneakers off Amazon but I’m glad they’re legit. He loves them & I will def be purchasing more in the future!", "title": "Legit!", "location_and_date": "Reviewed in the United States on June 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "nike", "text": "Absolutely perfect product!", "title": "Pandas", "location_and_date": "Reviewed in the United States on July 6, 2023", "verified": true, "rating": "5.0"},
{"asin": "nike", "text": "⭐️⭐️⭐️⭐️⭐️I recommend", "title": "you should buy !", "location_and_date": "Reviewed in the United States on July 5, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "I love this hoodie. Love its quality and fit", "title": "Excellent product", "location_and_date": "Reviewed in the United States on July 19, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "Nice product, great quality and look GREAT", "title": "Better than expected", "location_and_date": "Reviewed in the United States on July 14, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "Sweatshirt looks awesome and is soft. Unfortunately it started peeling near the neck after one wash. So it becomes old looking very quickly", "title": "Looks good but low quality", "location_and_date": "Reviewed in the United States on July 3, 2023", "verified": true, "rating": "4.0"},
{"asin": "adidas", "text": "It look so nice on my son, he wears a medium in everything ordered a medium and it fits great! I've washed and dryed it a couple times and the color has not faded", "title": "Great hoodie", "location_and_date": "Reviewed in the United States on June 5, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "My husband loves it! Amazing quality, comfortable and love the color!", "title": "Great quality", "location_and_date": "Reviewed in the United States on June 13, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "My man loved this and it fits with his matching hat", "title": "Love", "location_and_date": "Reviewed in the United States on June 13, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "Great quality! My son loves these. Have bought in several colors.", "title": "Adidas Hoodie", "location_and_date": "Reviewed in the United States on June 6, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "The media could not be loaded.\n                \n            \n                \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n     Está sudadera es hermosa, super caliente y cómoda, me gusta que el cuello es alto, y con un diseño básico.", "title": "Me gustó mucho", "location_and_date": "Reviewed in the United States on June 29, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "Great Hoodie that absolutely is made to last and made of very high quality materials.You will instantly know what I mean when you feel them.They are softer on the inside as well.They don't shrink. Mine haven't shed any color and I bought both black and dark green.Totally worth it.", "title": "Great Hoodie. Heavy weight.", "location_and_date": "Reviewed in the United States on April 27, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "Very good quality, I'd buy it again.", "title": "I love it", "location_and_date": "Reviewed in the United States on May 24, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "My fiancé just loved it.", "title": "Quality and fit.", "location_and_date": "Reviewed in the United States 🇺🇸 on May 12, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "I was looking for a hoodie, sweatshirt, or tee in Adidas color Semi Turbo to wear with my Adidas leggings in dark heather gray with three Semi Turbo stripes going down the legs. The hoodie in Semi Turbo is the same color as the three stripes on my leggings! It can be difficult to find a good color match. But Adidas is right on with its colors!The hoodie is extremely soft, warm, and comfortable. I ordered a men's size small and it fits perfectly (slightly loose like a well-worn hoodie with plenty of room for layering underneath). I am 5'4\" and weigh 130 lbs.Great buy! I love Adidas clothing!", "title": "Soft, Warm, and Comfortable", "location_and_date": "Reviewed in the United States 🇺🇸 on January 14, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "It’s spring!  My son said I need to get out of black hoodies!This looks great it was incredibly speedy delivery and a great price", "title": "Great quality and a lovely colour", "location_and_date": "Reviewed in the United States 🇺🇸 on April 12, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "The fit is great and it is warm and very soft. The material is thick and very comfortable. The only thing is that it might fade after a couple washes.", "title": "Very Comfy, color fades after a few washes", "location_and_date": "Reviewed in the United States 🇺🇸 on March 20, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "Bought this recently - I'm about 5'10, 190 lbs and ordered a large and it fits perfectly. My arms are a little lengthier than some but the sleeves still fit well, not too short or too long.", "title": "COMFY - Fits as Expected", "location_and_date": "Reviewed in the United States 🇺🇸 on March 8, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "Muy bonita", "title": "Muy buen producto", "location_and_date": "Reviewed in the United States 🇺🇸 on April 22, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "I got this for my handsome man. The color is so pretty and the fit is perfect for skinny tall people. My sweet gentleman has made it his favorite it’s so comfortable", "title": "It’s perfect", "location_and_date": "Reviewed in the United States 🇺🇸 on March 10, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "This is a nice hoodie and fits as expected. Color as expected.", "title": "Nice Hoodie", "location_and_date": "Reviewed in the United States 🇺🇸 on January 20, 2023", "verified": true, "rating": "4.0"},
{"asin": "adidas", "text": "It fit perfectly and I run in between L and XL, I’m 200 lbs and I’m  6’1, I went with a L. I want ALL the colors !!", "title": "Material is GREAT", "location_and_date": "Reviewed in the United States 🇺🇸 on March 8, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "Muy buena compra…. Apenas justa la talla….", "title": "Muy buena…. Justa de talla", "location_and_date": "Reviewed in the United States 🇺🇸 on April 4, 2023", "verified": true, "rating": "5.0"},
{"asin": "lenovo", "text": "Fired up easily, Transferred apps and files (Helpful app) and I wasup and running.", "title": "Setup easier than I expected!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 2, 2023", "verified": true, "rating": "4.0"},
{"asin": "lenovo", "text": "Its just what I needed for the price.  I get more with this than some high priced HP.", "title": "Excellent laptop", "location_and_date": "Reviewed in the United States 🇺🇸 on July 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "lenovo", "text": "The purchase is with one year of office, and it is asking me for an activation key that didn't come in the box or with the computer.", "title": "it includes 1 year of MS office, and it is not including the activation key", "location_and_date": "Reviewed in the United States 🇺🇸 on June 2, 2023", "verified": true, "rating": "4.0"},
{"asin": "lenovo", "text": "Exelente Maquina para trabajar.", "title": "Laptop Lenovo", "location_and_date": "Reviewed in the United States 🇺🇸 on July 27, 2023", "verified": true, "rating": "5.0"},
{"asin": "lenovo", "text": "It is a good computer easy to set up and and pretty reliable", "title": "It gets the job done", "location_and_date": "Reviewed in the United States 🇺🇸 on June 4, 2023", "verified": true, "rating": "4.0"},
{"asin": "lenovo", "text": "Big bangs for the buck!", "title": "Great value", "location_and_date": "Reviewed in the United States 🇺🇸 on July 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "lenovo", "text": "The setup is terrible. Forces you to add email address, log in, and you can 't even log into the computer until you add all the Microsoft info they want. Forces you to add birthdate AND another email address too for recovery. I just want to use the darn computer without Microsoft, it's not hard. Had to create another fake email for it to work. What should have been 3 minutes took me 30 minutes.", "title": "Setup is terrible", "location_and_date": "Reviewed in the United States 🇺🇸 on July 12, 2023", "verified": true, "rating": "3.0"},
{"asin": "lenovo", "text": "It's fast and easy to use and setup", "title": "Good quality", "location_and_date": "Reviewed in the United States 🇺🇸 on June 25, 2023", "verified": true, "rating": "5.0"},
{"asin": "lenovo", "text": "it includes 1 year of MS office, and it is not including the activation key", "title": "Activation key", "location_and_date": "Reviewed in the United States 🇺🇸 on June 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "lenovo", "text": "this laptop is fast and easy to use. its just what i needed", "title": "value for the money", "location_and_date": "Reviewed in the United States 🇺🇸 on May 28, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "5’9 - 160 lb I got a medium. You can really feel the quality with this hoodie. You can’t beat adidas", "title": "Great hoodie", "location_and_date": "Reviewed in the United States 🇺🇸 on March 8, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "My husband loves sweats and hoodies. Of all the hoodies he has now, this one is probably his favorite. It’s warm, soft, and a nice color. It’s worth the price if you ask him.", "title": "Husbands favorite", "location_and_date": "Reviewed in the United States 🇺🇸 on February 3, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "Good quality hoodie.", "title": "Comfy heavy weight hoodie", "location_and_date": "Reviewed in the United States 🇺🇸 on March 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "I had been looking everywhere for this color and I was luckily able to find it here and at a discount as well. Great find.", "title": "Convenience", "location_and_date": "Reviewed in the United States 🇺🇸 on February 7, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "Great", "title": "Great", "location_and_date": "Reviewed in the United States 🇺🇸 on March 16, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "i loved everything abt it i used it to wear out in the cold. Very comfortable (M)", "title": "love it comfortable and cute", "location_and_date": "Reviewed in the United States 🇺🇸 on February 5, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "It is a little too thick for the weather of where I live. But, I can't complain, Adidas is Adidas :)", "title": "Great", "location_and_date": "Reviewed in the United States 🇺🇸 on January 20, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "I got this for my 21 year old for Christmas he loved it, quality is great fits amazing", "title": "My son loved it", "location_and_date": "Reviewed in the United States 🇺🇸 on January 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "Nice hoodie but the sleeves for the arms are really really really long", "title": "Nice hoodie", "location_and_date": "Reviewed in the United States 🇺🇸 on February 1, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "Buen producto, como se ve en la imagen 100% original", "title": "Perfecto", "location_and_date": "Reviewed in the United States 🇺🇸 on February 7, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "My 16 year old loves it. Nice weight to the material!", "title": "Nice", "location_and_date": "Reviewed in the United States on January 16, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "Appears to be a good quality sweatshirt!Right size!Like the Powder Blue color!", "title": "Nice Quality Sweatshirt!", "location_and_date": "Reviewed in the United States on January 4, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "The color is perfect i was scared it would to purple my boyfriend loves it so happy with the purchase", "title": "Perfect hoodie", "location_and_date": "Reviewed in the United States on December 16, 2022", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "It's made of good material, it keeps you warm. the fabric is thick", "title": "warm", "location_and_date": "Reviewed in the United States on December 29, 2022", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "Good product, well made and my grandson loves it", "title": "Well made", "location_and_date": "Reviewed in the United States on December 29, 2022", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "Warm and thick, fits well and looks great! Highly recommend.", "title": "Excellent hoodie", "location_and_date": "Reviewed in the United States on December 14, 2022", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "Very nice quality, soft & comfy", "title": "Comfy sweatshirt", "location_and_date": "Reviewed in the United States on December 19, 2022", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "Great style and fit for a dude that isn't the slimmest, but the fabric pills very much upon the initial wash and still is pilling after 3 washes.  I tried to wash it inside out, and that seems to have somewhat helped.  Just warning you that on your first or second wear, expect to see little fuzz balls everywhere you take the sweatshirt on and off.", "title": "Only drawback is the fabric pilling", "location_and_date": "Reviewed in the United States on January 31, 2022", "verified": true, "rating": "4.0"},
{"asin": "adidas", "text": "XL", "title": "XL", "location_and_date": "Reviewed in the United States on January 2, 2023", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "Great fit and good quality!  Color was perfcet!!", "title": "Looks and fits great!!!", "location_and_date": "Reviewed in the United States on December 2, 2022", "verified": true, "rating": "5.0"},
{"asin": "lenovo", "text": "The product did not come with a 1-year subscription to MSO 365. I contacted the seller to get a key code for MSO. Instead, they provided me with a login and password to an existing product they owned. This has the potential for security breaches, etc. I had to purchase my own 1-year subscription to MSO 365 for $70. Please make sure you know that on top of the computer purchase, you will need to add another $70 for your subscription to MSO!", "title": "Does not come with a 1-year subscription to MSO 365", "location_and_date": "Reviewed in the United States on June 21, 2023", "verified": true, "rating": "2.0"},
{"asin": "lenovo", "text": "Had 24 days, not subjected to any form of abuse and not even heavy or moderate use. Opening the laptop today, there was extra resistance, and a bit of cracking sound. Bottom corner of screen bevel pulled apart. Poor build quality.", "title": "Screen broke", "location_and_date": "Reviewed in the United States on July 27, 2023", "verified": true, "rating": "2.0"},
{"asin": "lenovo", "text": "Where is the activation key for Windows 365? Says it comes with it for a year, but no activation code.Laptop is great. But, advertising that an item comes with something it doesn’t is a big deal breaker for future purchases.", "title": "Does not come with Windows 365 for a year as stated", "location_and_date": "Reviewed in the United States on July 25, 2023", "verified": true, "rating": "2.0"},
{"asin": "lenovo", "text": "I was not impressed with how cheap the material was for laptop. It felt like if it was bumped or dropped once it would shatter in to plastic pieces. Additionally it was supposed yo come with a year of Microsoft word & that wasn’t the case when I started to set it up. I received it today and just sent it back for a refund.", "title": "Cheaply Made", "location_and_date": "Reviewed in the United States on May 20, 2023", "verified": true, "rating": "2.0"},
{"asin": "lenovo", "text": "The computer set up is mediocre and the year of office is non existent", "title": "Good computer still a scam though", "location_and_date": "Reviewed in the United States on July 22, 2023", "verified": true, "rating": "2.0"},
{"asin": "lenovo", "text": "Am I missing something?  It says it has 256mg/2tb memory.  The one I order has 14gb.  That's it.  Returning.", "title": "Did not come with the memory that is advertised. Probably sending back.", "location_and_date": "Reviewed in the United States on June 7, 2023", "verified": true, "rating": "2.0"},
{"asin": "lenovo", "text": "I have only had this computer since it was delivered an hour ago. I really like that it is very light and it has a very appealing keyboard. The set up was very easy using the assistant. I was also able to find an app in the Microsoft store that allowed me to leave the edge and Windows S as I already have a Microsoft account. I was able to download chrome very easily. I am not going to be using it for fancy gaming and I will keep my hard drive available to hold my files but I will be using it for writing and other tasks. I am pleased with this computer so far and for the price it seems great.", "title": "Easy set up and easy to install chrome.", "location_and_date": "Reviewed in the United States on January 29, 2021", "verified": true, "rating": "5.0"},
{"asin": "lenovo", "text": "I am writing this approx 6 months after purchase. Great value laptop.  Powers up very quickly with zero sound. Good performance. The only reason it’s not getting 5 stars is because the camera quality is very average", "title": "Great value", "location_and_date": "Reviewed in the United States on November 29, 2021", "verified": true, "rating": "4.0"},
{"asin": "lenovo", "text": "I needed a computer to teach my online classes and this does the trick very will. The speed is fast (no hanging) with multiple windows running, the wifi is better than my previous device, decent camera and decent screen quality for videos too. The keyboard is also great for typing.  If I had a complaint it is that the speaker quality is low but I have Bluetooth speakers and headphones so it is not a bother. Overall, It's great value for the cost and works well.", "title": "Good processing speed, RAM quality, decent camera for online meetings.", "location_and_date": "Reviewed in the United States on September 17, 2021", "verified": true, "rating": "5.0"},
{"asin": "lenovo", "text": "This computer is not new like the seller claims. Upon arrival the battery will not charge over 2%. Now I am fighting to get a refund. These 3rd party electronic sellers on Amazon need to be banned.", "title": "NOT NEW - BATTERY NEVER WORKED", "location_and_date": "Reviewed in the United States on July 11, 2023", "verified": true, "rating": "1.0"},
{"asin": "adidas", "text": "Great , comfortable sweatshirt", "title": "Digging this sweatshirt", "location_and_date": "Reviewed in the United States on December 17, 2022", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "I feel like the sweatshirt is very long and also very tight at the bottom. It fits everywhere else perfectly as expected tho", "title": "Very long", "location_and_date": "Reviewed in the United States on December 28, 2022", "verified": true, "rating": "3.0"},
{"asin": "adidas", "text": "Great product and fits as expected.", "title": "True to size and comfortable.", "location_and_date": "Reviewed in the United States on November 21, 2022", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "I love these sweatshirts. I have it in 4 different colors. The item I received was dirty, stained, had hair all over it, smelled awful, and even had the tags cut off. My partner said, “It looks like the person packing it took their exact same sweatshirt off and gave you theirs instead.”If this sweatshirt had arrived brand new this would easily be a 5 star review. However, the disgusting trash I received instead was enough to put me off ordering clothes from Amazon for a while.", "title": "Pack and ship gone wrong", "location_and_date": "Reviewed in the United States on June 24, 2023", "verified": true, "rating": "1.0"},
{"asin": "adidas", "text": "Great fit!", "title": "Perfect fit, my son loves it. Wash inside out first before wearing.", "location_and_date": "Reviewed in the United States on October 21, 2022", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "Fit perfectly!", "title": "Comfy", "location_and_date": "Reviewed in the United States on April 29, 2022", "verified": true, "rating": "4.0"},
{"asin": "adidas", "text": "Thank you! Great Product!", "title": "Thank you! Great Product!", "location_and_date": "Reviewed in the United States on August 13, 2022", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "It's really comfortable but for some reason the fabric sticks to my shirt underneath? I don't know if anyone else experienced this.", "title": "Fits great", "location_and_date": "Reviewed in the United States on October 29, 2021", "verified": true, "rating": "4.0"},
{"asin": "adidas", "text": "I really like this sweatshirt. It's very comfortable, cozy and warm. I've washed it 3 times in cold water, and it still looks fresh. Very pleased with this purchase.", "title": "Soft and cozy.", "location_and_date": "Reviewed in the United States on January 27, 2022", "verified": true, "rating": "5.0"},
{"asin": "adidas", "text": "Purchased a size medium for my son who is a thin 5’7”.  It’s plenty roomy on him which is great, because he is growing like a weed.  Washes up nicely- didn’t notice any shrinking.", "title": "Great sweatshirt", "location_and_date": "Reviewed in the United States on October 25, 2021", "verified": true, "rating": "5.0"},
{"asin": "alienware", "text": "I’ve had this laptop for about 3 months now. I game on it pretty regularly. Always get high frame rates on high settings. So no complaint there. Yes it gets really hot while gaming around 82 degrees Celsius for the gpu. What I like about it is it pretty much stops using cpu and only uses the gpu while gaming. The charger does get hot but I have no need to touch it unless I’m just moving it around to get it out of the way. I’ve always wanted and Alienware and I’m 100% happy with what I bought and wouldn’t trade it for anything", "title": "Great for gaming", "location_and_date": "Reviewed in the United States on September 18, 2022", "verified": true, "rating": "5.0"},
{"asin": "alienware", "text": "*update this has been a huge headache, the monitor flickers and often forces the pc into sleep mode. Dell has sent a tech 3 times to replace damn near everything and the issue remains. I’m now being told to mail the system back so they can try to figure it out. I’ve had the machine 3 weeks and really can’t use it without this issue poking its head out so often it’s unusable. I really wish they’d just send me a replacement machine at this point it’s clearly faulty even after motherboard replaced, monitor replaced, fans and heat sink replaced, and have reset the system with clean install. C’mon Dell just own the issue of a faulty machine at this point and do right by the customer*First and foremost this thing is powerful. Beautiful display quality, and the design looks slick. That being said its not perfect but a machine this powerful you will expect some setbacks. She gets hot, so get a laptop pad that allows air to flow under more is a must, ones with fans will work a touch better. Just make sure its vented and not a flat surface, it makes a difference. The speakers do suck but who games with laptop speakers anyway?One thing to note is the white glove service you get from dell. My machine had a heating issue due to faulty cooling parts. Dell was absolutely helpful and sending a tech to my home to repair it onsite. You dont get that service many places at all. For that alone its a 5 star machine. 10/10 would recommend this if its in your budget and you need the power.", "title": "What a beast but I have a flawed machine*update*", "location_and_date": "Reviewed in the United States on September 20, 2022", "verified": true, "rating": "3.0"},
{"asin": "alienware", "text": "This Big boy can easily be considered a King of the gaming laptop world.It's large 17\" screen, hefty build structure, solid presence and powerful capability is what i wanted from an expensive gaming laptop and it delivers in those criteria sI got the NVIDIA 3070ti version with 16GB RAM which is plenty of power for modern day gaming.It's built like a tank so if you are looking for thin and easy this might not be it but if you want a proper and big screen to game and what not this is it", "title": "A King with some flaws but still a king", "location_and_date": "Reviewed in the United States on August 15, 2022", "verified": true, "rating": "5.0"},
{"asin": "alienware", "text": "I have been looking for an excellent gaming laptop that can handle my games without lag or crashing. I have been running a productivity laptop for years, so it was nice to see a computer run my games with little difficulty.", "title": "Finally got a good gaming laptop", "location_and_date": "Reviewed in the United States on May 17, 2022", "verified": true, "rating": "5.0"},
{"asin": "alienware", "text": "Extremely disappointed in Dell for the quality of this machine. The computer is defective and dangerous.Last week I purchased the computer brand new and it arrived in sealed box in “perfect” condition. Booted up with no issues and I proceeded to update with necessary drivers and software. A few hours later I go to turn off the computer and I pick up the power adapter and burn myself. Could not pick the adapter for about a half hour as it was much too hot to touch. Thought this was strange.The next day I boot up the computer again to see what happens to the power adapter. I do some light gaming for a few hours (all in-game graphics settings were set as default and profile of the graphics card was set to balanced with no over clocking). I finish and turn off the computer and again the power adapter is way too hot to touch. I then go to move the computer and touch the area above the function keys and subsequently burn myself again. What is going on…The third day is testing day. Armed with a digital infrared thermometer, I now have the tools to see how hot things are getting. Before booting up I scan the surface of the power adapter and area around the keyboard. All check out fine around room temperature ~72 degrees. I then boot up and repeat the same process as the previous day and after an hour I test. The surface of the power adapter (located unobstructed on the floor, no clutter around it) checks in at 150 degrees, and the backside on the floor checks in even hotter. Next I test around the surface of the computer (the entire unit including the fans and vents are unobstructed with the closet obstruction several feet away). The area above the function keys checks in over 140 degrees. Areas on the sides and corners above the fans check in around 120-130 degrees. The keyboard itself is over 110. Not good.The next day things take a drastic turn. After the tests of the previous day I shutdown the computer but this time I left the power adapter plugged into the wall and plugged into the computer overnight (previously I had been disconnecting these). I attempt to turn on the computer but it does not turn on. I then touch the keyboard and surface and am surprised as it is very warm, and the power adapter is also very warm. Further testing reveals the power adapter to be over 100 degrees and the area above the keyboard to be over 120 degrees. So now not only does the computer not boot, but it is also heating up to unacceptable levels when it is shutdown and plugged in. Further, after unplugging the power adapter to the shutdown computer and waiting 30 minutes, the unit still remains hot with surfaces over 120 degrees in some places.After evaluating all of the evidence (the two burns on my hands, the temperature readings, the computer settings, and the failure to boot) my verdict is that this machine is defective and dangerous. Burning oneself is bad enough, but this unit has the potential to cause far more damage. I do not feel comfortable keeping this machine inside my house and potentially putting the lives of my family at risk as I have no doubt that this computer is a dangerous fire hazard.I paid thousands of dollars for this computer and am extremely disappointed and frustrated that Dell would produce such a poor quality and dangerous product. I will be attempting to return/exchange this unit and luckily I am covered under the return grace period and manufacturers warranty. I also purchased the extended warranty as well and would recommend this to anyone making a purchase like this. Buyer Beware.", "title": "Defective and Dangerous", "location_and_date": "Reviewed in the United States on May 10, 2022", "verified": true, "rating": "1.0"},
{"asin": "alienware", "text": "I have been using this laptop daily since purchasing it, and I love it.  So far no issues, and runs games flawlessly.", "title": "Fantastic Laptop", "location_and_date": "Reviewed in the United States on May 13, 2022", "verified": true, "rating": "5.0"},
{"asin": "alienware", "text": "The best computer for everything you need wish it had a touchscreen but still like it", "title": "Laptop", "location_and_date": "Reviewed in the United States on May 17, 2022", "verified": true, "rating": "5.0"},
{"asin": "alienware", "text": "i like it", "title": "nice product", "location_and_date": "Reviewed in the United States on May 28, 2022", "verified": true, "rating": "5.0"},
{"asin": "alienware", "text": "The media could not be loaded.", "title": "Best of the best", "location_and_date": "Reviewed in the United States on May 4, 2022", "verified": true, "rating": "5.0"},
{"asin": "alienware", "text": "My wife wanted an Alienware laptop for the longest time, she was on cloud 9 when I gifted it to her, however, the joy did not last long. The laptop came with a factory sound issue, we fought with Dell's support center to replace the laptop, and we finally got a new replacement laptop, after smooth usage for 3 months on Jan 20th the laptop gave an error that the hard drive was not found and stopped turning off.My wife and I each spent 6+ hours with customer support to find out this is a factory issue and they refused to replace the laptop with a new one for the second time. Such a disappointment for our time and money.", "title": "Hidden factory issues and lots of time and money spent", "location_and_date": "Reviewed in the United States on February 17, 2023", "verified": true, "rating": "1.0"},
{"asin": "hisense", "text": "Previously ordered from another vendor, I will not list the name however, It was called on July 4th and delivery promised on July 6th by 10 pm. Moreover, it has yet to arrive and I'm still attempting to locate it and receive a refund. Needless to say, I ordered the same television on Amazon, and delivery was promised by July 09, 2023, by 9 pm to my surprise it was delivered straight to my door at 935 am. We installed it and it came with built-in speakers, I am well pleased Bravo Zulu to the Amazon associates for a job well done.", "title": "Excellent Product For Its Price", "location_and_date": "Reviewed in the United States on July 10, 2023", "verified": true, "rating": "5.0"},
{"asin": "hisense", "text": "This TV software is slow but for the price and the quality of what you get it been slow is a minor hiccup.", "title": "Amazing Value", "location_and_date": "Reviewed in the United States on July 21, 2023", "verified": true, "rating": "4.0"},
{"asin": "hisense", "text": "Picture is very  bright and  clear on my deck.", "title": "Work very  good on my deck!", "location_and_date": "Reviewed in the United States on July 19, 2023", "verified": true, "rating": "4.0"},
{"asin": "hisense", "text": "Great For The Money", "title": "Good Value For Your $", "location_and_date": "Reviewed in the United States on July 8, 2023", "verified": true, "rating": "4.0"},
{"asin": "hisense", "text": "I use this as a computer monitor for webcam streaming and I can also watch TV on it. It is perfect and the color looks great.", "title": "Love it", "location_and_date": "Reviewed in the United States on July 9, 2023", "verified": true, "rating": "5.0"},
{"asin": "hisense", "text": "This TV is the perfect size for a bedroom. Easy to set up and use. It seems there is some delay when using the remote. Also the colors are not that vibrant. I have a hisense a6 65in in my living room and the colors are way richer than this one. We were able to enhance them a little in the TV settings.  Nevertheless for $175 this TV is worth the money and my son enjoys it. Would purchase again.", "title": "Great for kids room", "location_and_date": "Reviewed in the United States on April 18, 2023", "verified": true, "rating": "4.0"},
{"asin": "hisense", "text": "Excellent TV, but the android software is a bit slow to respond", "title": "Excellent but slow response", "location_and_date": "Reviewed in the United States on May 30, 2023", "verified": true, "rating": "4.0"},
{"asin": "hisense", "text": "I love the size.Will a member of Walmart near me come out to mount it on my wall.I know they will $$", "title": "Quality. Price", "location_and_date": "Reviewed in the United States on June 27, 2023", "verified": true, "rating": "5.0"},
{"asin": "hisense", "text": "A little pricey but it is the exact size I needed for the space I have. Pretty sure I should post this on the subreddit Perfectfit", "title": "Got this for my bathroom", "location_and_date": "Reviewed in the United States on May 13, 2023", "verified": true, "rating": "4.0"},
{"asin": "hisense", "text": "Easy to set up. Everyone comments on the picture", "title": "Grwat Picture", "location_and_date": "Reviewed in the United States on July 7, 2023", "verified": true, "rating": "5.0"},
{"asin": "pavillion", "text": "IT WORK GOOD FOR ME AND I LOVE IT", "title": "AMAZING", "location_and_date": "Reviewed in the United States on July 20, 2023", "verified": true, "rating": "4.0"},
{"asin": "pavillion", "text": "When I opened it I noticed it was more plastic than metal so I had some skepticism. Turns out to be a nicely made unit. It’s super light weight. The cpu is under clocked. It doesn’t generate any substantial heat and the battery lasts most of the day. For my office type work it has plenty of firepower and never an issue. Would buy another one.", "title": "Quite impressed with its qualities", "location_and_date": "Reviewed in the United States on July 12, 2023", "verified": true, "rating": "5.0"},
{"asin": "pavillion", "text": "Es rápida,  tiene buena capacidad de datos, buena batería,  si tengo dificultad para escribir en Español", "title": "Laptop", "location_and_date": "Reviewed in the United States on May 26, 2023", "verified": true, "rating": "4.0"},
{"asin": "pavillion", "text": "This is a great laptop for the way I use it.  Light weight, cool running and quite powerful.  The only real complaints I can find are the terrible keyboard markings/colors and the single channel RAM.  Also I had trouble with the WIFI.  I can barely make out the keyboard markings because they are grey on grey and no contrast.  Solved this with a silicone keyboard overlay with white on black markings.I selected the 16 gB RAM version.  When I opened it to replace a crap WIFI adapter I discovered one 16gb stick of RAM and one empty slot.  I plan to add another stick of RAM ASAP as single-channel RAM can be a bottle-neck.  As to the WIFI, I could not keep connected at my usual 250-350 mbps, I had to restart every hour or two.  Solved with a new adapter.Other than these, no problems at all, and I found it easier to fix myself rather than send it back and pick another one.  With the above caveats I can still recommend this PC as a good useable machine for my daily driver.  The WIFI was probably a fluke and not a common problem, and you may not be affected as I was by the keyboard.  I say \"Go for it\"!", "title": "Great PC, terrible keyboard", "location_and_date": "Reviewed in the United States on August 11, 2022", "verified": true, "rating": "4.0"},
{"asin": "pavillion", "text": "It was a gift for my wife and she loves it so that means I love it", "title": "Works great", "location_and_date": "Reviewed in the United States on May 31, 2023", "verified": true, "rating": "5.0"},
{"asin": "pavillion", "text": "Start up is quick !  Two things that could have been done better is more space between the USB's,  I cannot plug in a stick and mouse at the same time.  I find the power button difficult to use, it barely rises above the surface.", "title": "Almost perfect", "location_and_date": "Reviewed in the United States on September 27, 2022", "verified": true, "rating": "4.0"},
{"asin": "pavillion", "text": "OK, I broke my cardinal rule of making a purchase of a product with zero reviews. Looks like I will get to start things off. On a bang for your buck scale, this item looks pretty good! I ordered it without relying on feedback from anyone. I was salivating over the arrival of my new play-pretty and was delighted to find that delivery was ahead of schedule! It arrived this morning and was handed to me by the Amazon driver. There was no apparent damage to the outer or inner packaging.As per the description, I was aware that the product would not be sealed because the product had been upgraded with a larger SSD drive as well as a memory upgrade. Everything seemed to be in order so I charged it for a few hours and gathered the info I would need to make it my own. This was to be a replacement for my old laptop that had finally surrendered.Windows 11 welcomed me and I proceeded to start jumping through the multiple hoops required of me by my friends at Microsoft. About halfway through, the screen went blank. That should have been a warning. But, nerd wanna-be that I am, said 'meh'...Let's restart it and see what happens...Long story; short...After MANY restarts, blue screens, blank screens, driver updates, google searches, and no lack of consternation, I decided that it was time to cut my losses and try again.At this point, I had already managed to share some of my information into the operating system and other areas of this machine, so I needed to purge that before I returned it to folks unknown. After the third reset, one actually completed and I am hopeful that it is clean now.The good folks at Amazon (politics notwithstanding) have always been super to work with and they really do take care of their customers! I know how new products can have their glitches, and that beta testers are sometimes customers. I am hopeful that I can update this review with glorious praise for the seller and the product! Stay Tuned!!!", "title": "Stay Tuned!", "location_and_date": "Reviewed in the United States on January 11, 2022", "verified": true, "rating": "1.0"},
{"asin": "pavillion", "text": "Student! Bought for college and I love it! Never had any issues with it. Runs games really well, and doesn't crash or give me any issues when downloading modifications for anything either. It lasts me all day during classes and has a great screen both for gaming and for my exams/homework/essays.", "title": "Perfect!", "location_and_date": "Reviewed in the United States on March 10, 2023", "verified": true, "rating": "5.0"},
{"asin": "pavillion", "text": "Si me agrado", "title": "Excelente", "location_and_date": "Reviewed in the United States on August 17, 2022", "verified": true, "rating": "4.0"},
{"asin": "pavillion", "text": "I ordered this laptop on June, 2022.A few weeks ago and I got the black screen with the blue window that states “boot device not found”, Hard Disk (3FO)”  see image...I called HP and they said it was no longer under warranty, expired on September, 04 2022. I argued with HP and sent them proof of purchase from Amazon so they updated the warranty and I sent it for warranty service.Then I was shocked when HP said it was not covered since the SSD drive was not original. Still awaiting HP to actually send this documentation after a few weeks.I didn't read the fine print that Oydisen WOWPC (third party) updates them. Also, it is not stated that the warranty is voided any wear on this page.So, at this point my new HP Laptop does not work", "title": "No warranty, do not buy", "location_and_date": "Reviewed in the United States on March 9, 2023", "verified": true, "rating": "1.0"},
{"asin": "umidigi", "text": "Nice first impression with a quality unpacking experience. It come with a transparent TPU case for your convenience. It run on Android 12 “Go Edition” so its lite enough for the processor. The navigation through the phone has nice haptic feedback. It's not heavy to carry and the color and build quality are outstanding. The phone is speedy enough to be functional including the cameras. The communication is loud and clear with no interruptions in conversations. Easy to connect to internet and the navigation is great. You can even play lite games like Sudoku with no problems. Listening your tones with Spotify and Bluetooth connected earbuds is very enjoyable. It has a big battery with the convenience of 10w fast charging that makes it a breeze. So for the money you get a nice phone with all the conveniences of the latest technology that won't let you down.", "title": "GREAT AFFORDABLE PHONE", "location_and_date": "Reviewed in the United States on June 20, 2023", "verified": true, "rating": "5.0"},
{"asin": "umidigi", "text": "Started using this phone as soon as i got it and everything was working fine but now just two hours in the speaker stopped working. The phone isn’t that fast and thats alright considering the price point but not the speaker has completely gone silent. Just needed this phone as an extra and a decoy while being in Mexico so i could hide my iPhone, but still did want this phone to work in all aspects. Everything was fine and the speaker did work when i first started using it but for whatever reason i started watching a video on YouTube and about 20 min in it just went silent. I tried restarting the phone, going into recovery mode, messed around with all the settings, and even resetting the phone but to no avail. The top speaker when you get calls does still work its just the bottom one that doesnt. Camera quality on it also sucks bad.", "title": "Speaker stopped working immediately", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": false, "rating": "1.0"},
{"asin": "umidigi", "text": "This is an inexpensive Android phone and assessing it should reflect that fact. If you take that perspective then this phone merits the four stars I'm giving it here. It is not nor does its makers claim it to be a premium product, but those who want premium performance should cough up the premium price for it. For the hundred bucks you do pay for this phone you get your money's worth, and a bit more. It's reliable, sturdy, and has the essentials you should expect for calls, on-line access, texting, and running most apps. The camera is not great and while I'm not much of a gamer, I don't expect that it would run the latest games with great efficiency. But this is a device I'd get for someone who wants basic Android functionality and is not interested in paying for all the bells and whistles of high-end brands. It's fine for less tech-centric people, and if you have a kid who wants a phone that handles the fastest games and demanding video, give him or her the hundred bucks that this one costs and tell them to go get an after-school job or solicit odd jobs for neighbors to raise the extra five, six, nine hundred or more dollars to get it. This one, however, is more than adequate for the basics.", "title": "You Get What You Pay For and That's OK", "location_and_date": "Reviewed in the United States on July 18, 2023", "verified": false, "rating": "4.0"},
{"asin": "umidigi", "text": "For the price point, you can't expect too much out of this. It's definitely slower than my s22, but that's to be expected.I can't attest to how it does with any network, as I'm not putting a sim in it. We're just using this as a mini tablet for my kid while traveling. It's MUCH easier to use and carry while flying than the regular kids tablet we have. Takes up less space in my backpack.Was able to sign into her google account and download all of the apps  I've purchased for her and download a few Disney plus movies to it. Paired with her bluetooth headphones great.", "title": "Excellent for a mini wifi tablet for my kid while traveling!", "location_and_date": "Reviewed in the United States on July 24, 2023", "verified": false, "rating": "4.0"},
{"asin": "umidigi", "text": "The phone runs on Android Go which is a trimmed down version of regular Android. You can do most of the same functions as regular Android but the the interface is just a bit different. So far I've had no issues with the apps I normally use. The screen is sharp and large. Camera functions are pretty limited and edit functions are just basic lighting fixes and cropping functions. I installed a Boost SIM card and did the required APN settings and got it going in no time. Wifi, hotspot....all good. The phone came with a screen protector and a case already installed which was very nice.", "title": "Nice basic entry level phone", "location_and_date": "Reviewed in the United States on July 9, 2023", "verified": false, "rating": "5.0"},
{"asin": "umidigi", "text": "This is a nice phone it's got decent storage and preforms okay the screen is nice and bright and it dose come with s case which is really cool", "title": "Nice little phone", "location_and_date": "Reviewed in the United States on July 6, 2023", "verified": false, "rating": "5.0"},
{"asin": "umidigi", "text": "i took it for my mom so not many picture but its really nice phone", "title": "Lovley", "location_and_date": "Reviewed in the United Kingdom on June 28, 2023", "verified": true, "rating": "4.0"},
{"asin": "umidigi", "text": "I have been using this phone for about a month and a half. Overall I am very impressed with how well the phone held up throughout its use time. I had dropped the phone numerous times due to being clumsy and it continued to work despite this with only the provided case as protection. In addition to this, you can download apps and use the phone without any real issues.I will note that at times the Bluetooth connection was spotty and I did have difficulty connecting Bluetooth devices to the phone. However, given the price this was a sacrifice I was willing to make.The camera quality is lower than average, however, again pretty good considering the cost of the phone.Overall, I think this is a good phone that will likely last at least a few months or year with the proper protection (case and screen protector).", "title": "Good phone for cost", "location_and_date": "Reviewed in Canada on July 6, 2023", "verified": true, "rating": "4.0"},
{"asin": "umidigi", "text": "It's works fine ok", "title": "Good price", "location_and_date": "Reviewed in Canada on July 26, 2023", "verified": true, "rating": "4.0"},
{"asin": "umidigi", "text": "子供のスマホデビューに購入しました！動きが鈍く感じたりアプリが落ちることがありますが、この価格なら妥協できます。", "title": "コスパは良い！", "location_and_date": "Reviewed in Japan on May 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "umidigi", "text": "I really like this phone the print is easy to read. Set it up via my old mobile easily reconnected. Has quite a large memory for storage.", "title": "This phone is easy to set up. Has a nice size print", "location_and_date": "Reviewed in the United Kingdom 🇬🇧 on June 4, 2023", "verified": true, "rating": "5.0"},
{"asin": "umidigi", "text": "動作が重たすぎてまともに動かない動画も見れない（カクカク）、LINEのアプリインストールも10分近くかかり、文字入力ですら反応悪すぎるサポートより連絡があり初期不良ということで返品していただきましたサポート対応は良かったです", "title": "初期不良で返品しました", "location_and_date": "Reviewed in Japan 🇯🇵 on May 10, 2023", "verified": true, "rating": "5.0"},
{"asin": "umidigi", "text": "This is a SOLID no nonsense backup phone. It gets all the basic job done, especially for the price.", "title": "SOLID backup phone", "location_and_date": "Reviewed in Canada 🇨🇦 on May 26, 2023", "verified": true, "rating": "4.0"},
{"asin": "umidigi", "text": "Bought this phone over a month ago.  Repeatedly drops phone calls.  I can make calls over WIFI (Messenger, etc.) and they remain intact for any length of call but if via SIM they drop.  You can make the call again but it will drop as well after an indeterminate period of time.  Using either a SAMSUNG or HUAWAEI phone from same location, same carrier and even same SIM works without interuption.  I can't find any suggestions how to resolve.", "title": "Not what I was hoping for", "location_and_date": "Reviewed in Canada 🇨🇦 on July 12, 2023", "verified": true, "rating": "2.0"},
{"asin": "umidigi", "text": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n     Was soll man sagen, für so wenig Geld 💸💸💸 hab ich was gutes bekommen... Respekt", "title": "Sehr gut bin eigentlich begeistert", "location_and_date": "Reviewed in Germany 🇩🇪 on June 15, 2023", "verified": true, "rating": "5.0"},
{"asin": "umidigi", "text": "Service was good, internet access problem was due to old 3G SIM card.I recommend this phone anytime for quality VS price.", "title": "Revised evaluation", "location_and_date": "Reviewed in Canada 🇨🇦 on June 5, 2023", "verified": true, "rating": "5.0"},
{"asin": "umidigi", "text": "Good battery size, good screen size, charges pretty quicklyIt will stall if you are running too many apps (more than 1)", "title": "Decent phone, not the best but not the worse either", "location_and_date": "Reviewed in Canada 🇨🇦 on June 16, 2023", "verified": true, "rating": "2.0"},
{"asin": "umidigi", "text": "Its a good working phone terrific price. I'm used to four gigs of ram but this phone has two. It does the job, screen is clear as good as my old LG. I'm happy", "title": "Good working cheap phone", "location_and_date": "Reviewed in Canada 🇨🇦 on May 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "umidigi", "text": "過去にUMIDIGIのスマホを購入しましたが、フリーズや再起動が連発で起こり同メーカのは二度と買うものか！と思ってましたが時間も経過したので再度トライ。２年前の嫌な不具合は発生せず、もっさりはしていますがある程度は使えるスマホになった模様です。最新アプリはサクサクといった感じでは動かないため、ラインや通話メインであれば全然問題なく使えます。スペックは控えめなので、サブ機として使うには最適なスマホです。カメラは思っていたより綺麗でコントラストの強い画像が撮れます。動画視聴、カメラ撮影がメインの方にはおススメですね。", "title": "過去に同社のスマホで痛い思いをしましたが。。。", "location_and_date": "Reviewed in Japan 🇯🇵 on May 28, 2023", "verified": false, "rating": "4.0"},
{"asin": "umidigi", "text": "スペックとしては「画質や速度にこだわりがなく、電話やメール、SNS等が普通に見られれば良い」という人向けのものになります。ゲームを動かすとかなりガクつきました。また、私が試した中ではRakutenが使用不可。Ymobileは使用できました。全てのSIMが使えるわけではないので要注意です。", "title": "必要最低限のスマホ", "location_and_date": "Reviewed in Japan 🇯🇵 on June 11, 2023", "verified": false, "rating": "3.0"}
]